ycsb_logs_hugepage/load.log
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000
[OVERALL], RunTime(ms), 2209
[OVERALL], Throughput(ops/sec), 679.040289723857
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 416.0
[CLEANUP], MinLatency(us), 416
[CLEANUP], MaxLatency(us), 416
[CLEANUP], 95thPercentileLatency(us), 416
[CLEANUP], 99thPercentileLatency(us), 416
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 141.41933333333333
[INSERT], MinLatency(us), 36
[INSERT], MaxLatency(us), 4163
[INSERT], 95thPercentileLatency(us), 482
[INSERT], 99thPercentileLatency(us), 698
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=64
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 279.0
[CLEANUP], MinLatency(us), 279
[CLEANUP], MaxLatency(us), 279
[CLEANUP], 95thPercentileLatency(us), 279
[CLEANUP], 99thPercentileLatency(us), 279
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 109.89266666666667
[INSERT], MinLatency(us), 33
[INSERT], MaxLatency(us), 2061
[INSERT], 95thPercentileLatency(us), 172
[INSERT], 99thPercentileLatency(us), 292
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=128
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 292.0
[CLEANUP], MinLatency(us), 292
[CLEANUP], MaxLatency(us), 292
[CLEANUP], 95thPercentileLatency(us), 292
[CLEANUP], 99thPercentileLatency(us), 292
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 85.32466666666667
[INSERT], MinLatency(us), 33
[INSERT], MaxLatency(us), 2603
[INSERT], 95thPercentileLatency(us), 152
[INSERT], 99thPercentileLatency(us), 204
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=192
[OVERALL], RunTime(ms), 1509
[OVERALL], Throughput(ops/sec), 994.0357852882704
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 418.0
[CLEANUP], MinLatency(us), 418
[CLEANUP], MaxLatency(us), 418
[CLEANUP], 95thPercentileLatency(us), 418
[CLEANUP], 99thPercentileLatency(us), 418
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 97.27466666666666
[INSERT], MinLatency(us), 45
[INSERT], MaxLatency(us), 2679
[INSERT], 95thPercentileLatency(us), 151
[INSERT], 99thPercentileLatency(us), 229
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=256
[OVERALL], RunTime(ms), 1512
[OVERALL], Throughput(ops/sec), 992.063492063492
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 412.0
[CLEANUP], MinLatency(us), 412
[CLEANUP], MaxLatency(us), 412
[CLEANUP], 95thPercentileLatency(us), 412
[CLEANUP], 99thPercentileLatency(us), 412
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 134.04733333333334
[INSERT], MinLatency(us), 35
[INSERT], MaxLatency(us), 2525
[INSERT], 95thPercentileLatency(us), 366
[INSERT], 99thPercentileLatency(us), 576
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=320
[OVERALL], RunTime(ms), 1513
[OVERALL], Throughput(ops/sec), 991.4077990746861
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 730.0
[CLEANUP], MinLatency(us), 730
[CLEANUP], MaxLatency(us), 730
[CLEANUP], 95thPercentileLatency(us), 730
[CLEANUP], 99thPercentileLatency(us), 730
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 93.14533333333334
[INSERT], MinLatency(us), 35
[INSERT], MaxLatency(us), 3575
[INSERT], 95thPercentileLatency(us), 282
[INSERT], 99thPercentileLatency(us), 376
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=384
[OVERALL], RunTime(ms), 1511
[OVERALL], Throughput(ops/sec), 992.7200529450695
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 399.0
[CLEANUP], MinLatency(us), 399
[CLEANUP], MaxLatency(us), 399
[CLEANUP], 95thPercentileLatency(us), 399
[CLEANUP], 99thPercentileLatency(us), 399
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 105.15933333333334
[INSERT], MinLatency(us), 34
[INSERT], MaxLatency(us), 2485
[INSERT], 95thPercentileLatency(us), 335
[INSERT], 99thPercentileLatency(us), 492
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=448
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 424.0
[CLEANUP], MinLatency(us), 424
[CLEANUP], MaxLatency(us), 424
[CLEANUP], 95thPercentileLatency(us), 424
[CLEANUP], 99thPercentileLatency(us), 424
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 111.33333333333333
[INSERT], MinLatency(us), 52
[INSERT], MaxLatency(us), 2471
[INSERT], 95thPercentileLatency(us), 234
[INSERT], 99thPercentileLatency(us), 433
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=512
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 909.0
[CLEANUP], MinLatency(us), 909
[CLEANUP], MaxLatency(us), 909
[CLEANUP], 95thPercentileLatency(us), 909
[CLEANUP], 99thPercentileLatency(us), 909
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 117.41066666666667
[INSERT], MinLatency(us), 34
[INSERT], MaxLatency(us), 2399
[INSERT], 95thPercentileLatency(us), 291
[INSERT], 99thPercentileLatency(us), 487
[INSERT], Return=OK, 1500